package Lesson2;

//Создайте две переменные типа int. Поделите одно число на
//второе. Вывести получившийся результат. Сделать так,
//чтобы результатом вывода был тип double.

public class Task3 {
    public static void main(String[] args) {
        int a = 10;
        int b = 6;
        double c = (double) a / b;
        System.out.println(c);
    }
}