package Lesson2;

//Дано число типа double. Окуглите это число до целого,
//используя все известные вам способы.

public class Task5 {
    public static void main(String[] args) {
        double a = 6.67;
        double b = Math.round(a);
            System.out.println(b);

    }
}